/* @tsx */

import React from 'react'

const MessageBack = () => (
  <svg width="10px" height="18px" viewBox="0 0 10 18" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink">
    <g id="消息中心-消息详情" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd" transform="translate(-100.000000, -105.000000)">
      <g id="左边" transform="translate(100.000000, 105.000000)" fill="#D8D8D8" fillRule="nonzero">
        <path d="M2.30121286,9.00017779 L9.7208521,1.61845563 C10.0930493,1.24818427 10.0930493,0.647974872 9.7208521,0.277703517 C9.3486549,-0.0925678389 8.7453237,-0.0925678389 8.3731265,0.277703517 L0.279147902,8.32980175 C-0.0930493006,8.7000731 -0.0930493006,9.3002825 0.279147902,9.67055386 L8.37264993,17.722178 C8.55898681,17.9075507 8.80251149,18 9.04651272,18 C9.29051395,18 9.53403863,17.9075507 9.72037551,17.722178 C10.0925727,17.3519066 10.0925727,16.7516972 9.72037551,16.3814259 L2.30121286,9.00017779 Z" id="Shape" />
      </g>
    </g>
  </svg>
)

export default MessageBack
